maze = [
    ["#", "#", "#", "#", "#", "#", "#"],
    ["#", " ", " ", " ", " ", " ", "#"],
    ["#", " ", "#", "#", "#", " ", "#"],
    ["#", " ", "#", "E", " ", " ", "#"],
    ["#", " ", "#", "#", "#", " ", "#"],
    ["#", " ", " ", " ", "#", " ", "#"],
    ["#", "#", "0", "#", "#", "#", "#"]
]
def is_empty(x, y):
    if maze[x][y] == '#':
        return [False, 'Ход невозможен. Вы уперлись в стену.']
    elif maze[x][y] == '-':
        return [False, 'Ход невозможен. Вы там уже были.']
    elif maze[x][y] == ' ':
        return [True, 'Вы походили.']

def print_maze(maze):
    for i in range(len(maze)):
        for j in range(len(maze[i])):
            print(maze[i][j], end=' ')
        print()

def find_exit(maze, x, y):
    player = [x, y]
    cnt_moves = 0
        
    print('Добро пожаловать в игру "Лабиринт".')
    print('Игрок на карте обозначен буквой "Е".')
    print('Ваша цель покинуть лабиринт, зайдя на клетку "0".')
    print('Управление игроком производится путем ввода букв: ')
    print('"W" - перемещает наверх.')
    print('"A" - перемещает налево.')
    print('"S" - перемещает вниз.')
    print('"D" - перемещает вправо.')
    print('Если вы захотели выйти напишите "exit". Резистр ввода по желанию.')
    
    print_maze(maze)
    
    
print_maze(maze)
find_exit(maze, 3, 3)